Fondamentaux/TD1_Poiseuille/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Cible Poiseuille laminaire raisonnable: Umean = 0.1 m/s (Umax ~ 0.15 m/s)
// Re = Umean*H/nu = 0.1*0.01/1e-6 = 1000
internalField   uniform (0.1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        // Inlet uniforme: le profil parabolique se développe dans le canal.
        value           uniform (0.1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
