Fondamentaux/TD1_Poiseuille/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       1930;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       1950;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       1970;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       2020;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       2070;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       3070;
    }
)

// ************************************************************************* //
